{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "7bcc44c6",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from graphdatascience import GraphDataScience"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1bc5f291",
   "metadata": {},
   "source": [
    "## Setup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "29e6bede",
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"neo4j://localhost:7687\"\n",
    "password = 'password'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "0cb4e7e9",
   "metadata": {},
   "outputs": [],
   "source": [
    "creds = ('neo4j', password)\n",
    "gds = GraphDataScience(URI, auth=creds)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "22a0fb4a",
   "metadata": {},
   "source": [
    "## Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "a41f37ad",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.read_csv(r\"C:\\Users\\33638\\Documents\\GitHub\\domaine-nc-jupyter-notebook\\domaine-nc.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "06bc4214",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "False    6683\n",
       "True       19\n",
       "Name: isProtected, dtype: int64"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.isProtected.value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "9c5e94fc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nom</th>\n",
       "      <th>extension</th>\n",
       "      <th>isProtected</th>\n",
       "      <th>gestionnaire</th>\n",
       "      <th>beneficiaire</th>\n",
       "      <th>status</th>\n",
       "      <th>dns1</th>\n",
       "      <th>dns2</th>\n",
       "      <th>dns3</th>\n",
       "      <th>dns4</th>\n",
       "      <th>dns5</th>\n",
       "      <th>dns6</th>\n",
       "      <th>dateCreation</th>\n",
       "      <th>dateModification</th>\n",
       "      <th>dateExpiration</th>\n",
       "      <th>nbDaysBeforeExpires</th>\n",
       "      <th>expired</th>\n",
       "      <th>note</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>949</th>\n",
       "      <td>boulouparis</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1364</th>\n",
       "      <td>chirurgiens-dentistes</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1959</th>\n",
       "      <td>drehu</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2691</th>\n",
       "      <td>gouvernement</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2706</th>\n",
       "      <td>gratuit</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2931</th>\n",
       "      <td>iaai</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3942</th>\n",
       "      <td>marchespublics</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3945</th>\n",
       "      <td>mare</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4088</th>\n",
       "      <td>mercedes</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4256</th>\n",
       "      <td>mont-dore</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4259</th>\n",
       "      <td>montdore</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4854</th>\n",
       "      <td>paita</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5455</th>\n",
       "      <td>sages</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5766</th>\n",
       "      <td>sms</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6216</th>\n",
       "      <td>thio</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6217</th>\n",
       "      <td>thiriet</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6231</th>\n",
       "      <td>tieti</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6619</th>\n",
       "      <td>whois</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6662</th>\n",
       "      <td>yate</td>\n",
       "      <td>nc</td>\n",
       "      <td>True</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        nom extension  isProtected gestionnaire beneficiaire  \\\n",
       "949             boulouparis        nc         True          NaN          NaN   \n",
       "1364  chirurgiens-dentistes        nc         True          NaN          NaN   \n",
       "1959                  drehu        nc         True          NaN          NaN   \n",
       "2691           gouvernement        nc         True          NaN          NaN   \n",
       "2706                gratuit        nc         True          NaN          NaN   \n",
       "2931                   iaai        nc         True          NaN          NaN   \n",
       "3942         marchespublics        nc         True          NaN          NaN   \n",
       "3945                   mare        nc         True          NaN          NaN   \n",
       "4088               mercedes        nc         True          NaN          NaN   \n",
       "4256              mont-dore        nc         True          NaN          NaN   \n",
       "4259               montdore        nc         True          NaN          NaN   \n",
       "4854                  paita        nc         True          NaN          NaN   \n",
       "5455                  sages        nc         True          NaN          NaN   \n",
       "5766                    sms        nc         True          NaN          NaN   \n",
       "6216                   thio        nc         True          NaN          NaN   \n",
       "6217                thiriet        nc         True          NaN          NaN   \n",
       "6231                  tieti        nc         True          NaN          NaN   \n",
       "6619                  whois        nc         True          NaN          NaN   \n",
       "6662                   yate        nc         True          NaN          NaN   \n",
       "\n",
       "     status dns1 dns2 dns3 dns4 dns5 dns6 dateCreation dateModification  \\\n",
       "949     NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "1364    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "1959    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "2691    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "2706    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "2931    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "3942    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "3945    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "4088    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "4256    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "4259    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "4854    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "5455    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "5766    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "6216    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "6217    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "6231    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "6619    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "6662    NaN  NaN  NaN  NaN  NaN  NaN  NaN          NaN              NaN   \n",
       "\n",
       "     dateExpiration  nbDaysBeforeExpires expired note  \n",
       "949             NaN                  NaN     NaN  NaN  \n",
       "1364            NaN                  NaN     NaN  NaN  \n",
       "1959            NaN                  NaN     NaN  NaN  \n",
       "2691            NaN                  NaN     NaN  NaN  \n",
       "2706            NaN                  NaN     NaN  NaN  \n",
       "2931            NaN                  NaN     NaN  NaN  \n",
       "3942            NaN                  NaN     NaN  NaN  \n",
       "3945            NaN                  NaN     NaN  NaN  \n",
       "4088            NaN                  NaN     NaN  NaN  \n",
       "4256            NaN                  NaN     NaN  NaN  \n",
       "4259            NaN                  NaN     NaN  NaN  \n",
       "4854            NaN                  NaN     NaN  NaN  \n",
       "5455            NaN                  NaN     NaN  NaN  \n",
       "5766            NaN                  NaN     NaN  NaN  \n",
       "6216            NaN                  NaN     NaN  NaN  \n",
       "6217            NaN                  NaN     NaN  NaN  \n",
       "6231            NaN                  NaN     NaN  NaN  \n",
       "6619            NaN                  NaN     NaN  NaN  \n",
       "6662            NaN                  NaN     NaN  NaN  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[df.beneficiaire.isna()]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d535b69",
   "metadata": {},
   "source": [
    "## CREATE CSV"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "695a2def",
   "metadata": {},
   "outputs": [],
   "source": [
    "gestionnaire = df.gestionnaire.unique().tolist()\n",
    "gestionnaire.remove('AUCUN')\n",
    "beneficiaire = df.beneficiaire.unique().tolist()\n",
    "dns = df.dns1.unique().tolist() + df.dns2.unique().tolist() + df.dns3.unique().tolist() + df.dns4.unique().tolist() + df.dns5.unique().tolist() + df.dns6.unique().tolist()\n",
    "dns = list(set(dns))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "238375fd",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_gestionnaire = pd.DataFrame({\"gestionnaire\":gestionnaire})\n",
    "df_beneficiaire = pd.DataFrame({\"beneficiaire\":beneficiaire})\n",
    "df_dns = pd.DataFrame({\"dns\":dns})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "4534b5e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "df_gestionnaire.to_csv(\"gestionnaires.csv\",index=False)\n",
    "df_beneficiaire.to_csv(\"beneficiaires.csv\",index=False)\n",
    "df_dns.to_csv(\"dns.csv\",index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "32d9b80c",
   "metadata": {},
   "source": [
    "### Pour la suite de l'execution du Notebook, il est nécessaire de copier les 4 fichiers CSV dans le dossier import associé à la base de données neo4J"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1500bb84",
   "metadata": {},
   "source": [
    "![alt text](im1.png \"Title\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "662932f3",
   "metadata": {},
   "source": [
    "## Create Constraint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "21a61c5f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_constrainte(constraint):\n",
    "    c = f'''\n",
    "    // Create constraints\n",
    "    CREATE CONSTRAINT {constraint} IF NOT EXISTS ON (i:{constraint}) ASSERT i.id IS UNIQUE;\n",
    "    '''\n",
    "    gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "7172cd18",
   "metadata": {},
   "outputs": [],
   "source": [
    "create_constrainte(\"Gestionnaires\")\n",
    "create_constrainte(\"Beneficiaires\")\n",
    "create_constrainte(\"dns\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68afb366",
   "metadata": {},
   "source": [
    "## Import Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "fb1457d7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6702</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      6702"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load node list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "CREATE (:Site {nbDaysBeforeExpires : toInteger(line.nbDaysBeforeExpires), extension : line.extension, isProtected : line.isProtected, status : line.status, dateCreation : line.dateCreation, dateModification : line.dateModification, dateExpiration : line.dateExpiration, id: line.nom, expired : line.expired})\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "e16ddba7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>56</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0        56"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load node list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///gestionnaires.csv' AS line\n",
    "WITH line\n",
    "CREATE (:Gestionnaires {id:line.gestionnaire})\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "d3001cf4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3596</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      3596"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load node list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///beneficiaires.csv' AS line\n",
    "CREATE (:Beneficiaires {id:line.beneficiaire})\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "ff9c9ac8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2138</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      2138"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load node list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///dns.csv' AS line\n",
    "CREATE (:dns {id:line.dns})\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "c1d00b71",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "MATCH (n:Gestionnaires {id: 'AUCUN'})\n",
    "DELETE n\n",
    "'''\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a2f3396e",
   "metadata": {},
   "source": [
    "## Import Edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "ee2c2c1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2471</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      2471"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Gestionnaires {id: line.gestionnaire})\n",
    "MATCH (target:Site {id: line.nom})\n",
    "MERGE (source)-[:GERE]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "0e51005c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6695</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      6695"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Beneficiaires {id: line.beneficiaire})\n",
    "MATCH (target:Site {id: line.nom})\n",
    "MERGE (source)-[:POSSEDE]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "a0686e32",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6695</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      6695"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Site {id: line.nom})\n",
    "MATCH (target:dns {id: line.dns1})\n",
    "MERGE (source)-[:HEBERGESUR]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "2a5ebceb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6695</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      6695"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Site {id: line.nom})\n",
    "MATCH (target:dns {id: line.dns2})\n",
    "MERGE (source)-[:HEBERGESUR]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "5177b8d0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2591</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      2591"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Site {id: line.nom})\n",
    "MATCH (target:dns {id: line.dns3})\n",
    "MERGE (source)-[:HEBERGESUR]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "f199edcd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1090</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      1090"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Site {id: line.nom})\n",
    "MATCH (target:dns {id: line.dns4})\n",
    "MERGE (source)-[:HEBERGESUR]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "6ac9a90c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>181</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0       181"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Site {id: line.nom})\n",
    "MATCH (target:dns {id: line.dns5})\n",
    "MERGE (source)-[:HEBERGESUR]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "f5d033b6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0        37"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Site {id: line.nom})\n",
    "MATCH (target:dns {id: line.dns6})\n",
    "MERGE (source)-[:HEBERGESUR]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "4c542ae5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2466</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(*)\n",
       "0      2466"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c = '''\n",
    "// Load edge list\n",
    "LOAD CSV WITH HEADERS FROM 'file:///domaine-nc.csv' AS line\n",
    "WITH line\n",
    "MATCH (source:Beneficiaires {id: line.beneficiaire})\n",
    "MATCH (target:Gestionnaires {id: line.gestionnaire})\n",
    "MERGE (source)-[:CLIENTDE]->(target)\n",
    "RETURN COUNT(*)\n",
    "'''\n",
    "\n",
    "gds.run_cypher(c)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2904ddc3",
   "metadata": {},
   "source": [
    "## CLEAR DMBS (Si besoin enlever les paranthèses)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "57675096",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"c = '''\\n//\\nMATCH (n)\\nDELETE n\\n'''\\ngds.run_cypher(c)\""
      ]
     },
     "execution_count": 117,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"\"\"c = '''\n",
    "//\n",
    "MATCH (n)\n",
    "DELETE n\n",
    "'''\n",
    "gds.run_cypher(c)\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9b8a79eb",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.8.8 ('base')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  },
  "vscode": {
   "interpreter": {
    "hash": "7d1962ebe7a0e2a2e85ea33467ffefcaf9a1a84cbc83a928177a012af89e0b2e"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
